[Survived] BooleanLiteral
learning/stryker-vue-example/src/main.js:4:28
 import Vue from 'vue'
 import App from './App.vue'
 
-Vue.config.productionTip = false
+Vue.config.productionTip = true
 
 new Vue({

[Survived] ObjectLiteral
learning/stryker-vue-example/src/main.js:6:9
 
 Vue.config.productionTip = false
 
-new Vue({
-  render: h => h(App),
-}).$mount('#app')
+new Vue({}).$mount('#app')
 

[Survived] ArrowFunction
learning/stryker-vue-example/src/main.js:7:11
 Vue.config.productionTip = false
 
 new Vue({
-  render: h => h(App),
+  render: () => undefined,
 }).$mount('#app')
 

[Survived] StringLiteral
learning/stryker-vue-example/src/main.js:8:11
 
 new Vue({
   render: h => h(App),
-}).$mount('#app')
+}).$mount("")
 
