[Survived] StringLiteral
learning/stryker-vue-example/src/App.vue:12:9
 import HelloWorld from './components/HelloWorld.vue'
 
 export default {
-  name: 'App',
+  name: "",
   components: {
     HelloWorld
