[Killed] BlockStatement
stryker-vue-example/src/utils/index.js:1:29
-export function fizzBuzz(n) {
-    if (n % 15 === 0) {
-        return 'Fizz Buzz';
-    }
-    if (n % 5 === 0) {
-        return 'Buzz';
-    }
-    if (n % 3 === 0) {
-        return 'Fizz';
-    }
-    return n;
-}
+export function fizzBuzz(n) {}
 
 export function isPrime(n) {
killedBy: FizzBuzz test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Fizz Buzz"
Received: undefined

[Killed] ConditionalExpression
stryker-vue-example/src/utils/index.js:2:9
 export function fizzBuzz(n) {
-    if (n % 15 === 0) {
+    if (true) {
         return 'Fizz Buzz';
     }
killedBy: FizzBuzz test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Buzz"
Received: "Fizz Buzz"

[Killed] EqualityOperator
stryker-vue-example/src/utils/index.js:2:9
 export function fizzBuzz(n) {
-    if (n % 15 === 0) {
+    if (n % 15 !== 0) {
         return 'Fizz Buzz';
     }
killedBy: FizzBuzz test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Fizz Buzz"
Received: "Buzz"

[Killed] StringLiteral
stryker-vue-example/src/utils/index.js:3:16
 export function fizzBuzz(n) {
     if (n % 15 === 0) {
-        return 'Fizz Buzz';
+        return "";
     }
     if (n % 5 === 0) {
killedBy: FizzBuzz test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Fizz Buzz"
Received: ""

[Killed] ConditionalExpression
stryker-vue-example/src/utils/index.js:5:9
     if (n % 15 === 0) {
         return 'Fizz Buzz';
     }
-    if (n % 5 === 0) {
+    if (false) {
         return 'Buzz';
     }
killedBy: FizzBuzz test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Buzz"
Received: 10

[Killed] EqualityOperator
stryker-vue-example/src/utils/index.js:5:9
     if (n % 15 === 0) {
         return 'Fizz Buzz';
     }
-    if (n % 5 === 0) {
+    if (n % 5 !== 0) {
         return 'Buzz';
     }
killedBy: FizzBuzz test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Buzz"
Received: 10

[Killed] StringLiteral
stryker-vue-example/src/utils/index.js:6:16
         return 'Fizz Buzz';
     }
     if (n % 5 === 0) {
-        return 'Buzz';
+        return "";
     }
     if (n % 3 === 0) {
killedBy: FizzBuzz test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Buzz"
Received: ""

[Killed] ConditionalExpression
stryker-vue-example/src/utils/index.js:8:9
     if (n % 5 === 0) {
         return 'Buzz';
     }
-    if (n % 3 === 0) {
+    if (true) {
         return 'Fizz';
     }
killedBy: FizzBuzz test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: "Fizz"

[Killed] ArithmeticOperator
stryker-vue-example/src/utils/index.js:8:9
     if (n % 5 === 0) {
         return 'Buzz';
     }
-    if (n % 3 === 0) {
+    if (n * 3 === 0) {
         return 'Fizz';
     }
killedBy: FizzBuzz test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Fizz"
Received: 9

[Killed] BlockStatement
stryker-vue-example/src/utils/index.js:14:28
     return n;
 }
 
-export function isPrime(n) {
-    if (n === 1) {
-        return false;
-    } else {
-        for(let i = 2;i <= Math.trunc(Math.sqrt(n));i++) {
-            if (n % i === 0) return false;
-        }
-        return true;
-    }
-}
+export function isPrime(n) {}
killedBy: isPrime test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ConditionalExpression
stryker-vue-example/src/utils/index.js:15:9
 }
 
 export function isPrime(n) {
-    if (n === 1) {
+    if (false) {
         return false;
     } else {
killedBy: isPrime test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
stryker-vue-example/src/utils/index.js:15:18
 }
 
 export function isPrime(n) {
-    if (n === 1) {
-        return false;
-    } else {
+    if (n === 1) {} else {
         for(let i = 2;i <= Math.trunc(Math.sqrt(n));i++) {
             if (n % i === 0) return false;
killedBy: isPrime test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BooleanLiteral
stryker-vue-example/src/utils/index.js:16:16
 
 export function isPrime(n) {
     if (n === 1) {
-        return false;
+        return true;
     } else {
         for(let i = 2;i <= Math.trunc(Math.sqrt(n));i++) {
killedBy: isPrime test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
stryker-vue-example/src/utils/index.js:17:12
 export function isPrime(n) {
     if (n === 1) {
         return false;
-    } else {
-        for(let i = 2;i <= Math.trunc(Math.sqrt(n));i++) {
-            if (n % i === 0) return false;
-        }
-        return true;
-    }
+    } else {}
 }
killedBy: isPrime test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] UpdateOperator
stryker-vue-example/src/utils/index.js:18:53
     if (n === 1) {
         return false;
     } else {
-        for(let i = 2;i <= Math.trunc(Math.sqrt(n));i++) {
+        for(let i = 2;i <= Math.trunc(Math.sqrt(n));i--) {
             if (n % i === 0) return false;
         }
killedBy: isPrime test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] EqualityOperator
stryker-vue-example/src/utils/index.js:18:23
     if (n === 1) {
         return false;
     } else {
-        for(let i = 2;i <= Math.trunc(Math.sqrt(n));i++) {
+        for(let i = 2;i < Math.trunc(Math.sqrt(n));i++) {
             if (n % i === 0) return false;
         }

[Killed] EqualityOperator
stryker-vue-example/src/utils/index.js:19:17
         return false;
     } else {
         for(let i = 2;i <= Math.trunc(Math.sqrt(n));i++) {
-            if (n % i === 0) return false;
+            if (n % i !== 0) return false;
         }
         return true;
killedBy: isPrime test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
stryker-vue-example/src/utils/index.js:19:17
         return false;
     } else {
         for(let i = 2;i <= Math.trunc(Math.sqrt(n));i++) {
-            if (n % i === 0) return false;
+            if (true) return false;
         }
         return true;
killedBy: isPrime test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
