[Killed] ObjectLiteral
stryker-vue-example/src/components/HelloWorld.vue:34:16
 </template>
 
 <script>
-export default {
-  name: 'HelloWorld',
-  props: {
-    msg: String
-  }
-}
+export default {}
 </script>
 
killedBy: HelloWorld.vue renders props.msg when passed
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "new message"
Received string:    "For a guide and recipes on how to configure / customize this project,
    check out the
    vue-cli documentation.
   Installed CLI Plugins babel eslint Essential Links Core Docs Forum Community Chat Twitter News Ecosystem vue-router vuex vue-devtools vue-loader awesome-vue"

[Killed] ObjectLiteral
stryker-vue-example/src/components/HelloWorld.vue:36:10
 <script>
 export default {
   name: 'HelloWorld',
-  props: {
-    msg: String
-  }
+  props: {}
 }
 </script>
killedBy: HelloWorld.vue renders props.msg when passed
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "new message"
Received string:    "For a guide and recipes on how to configure / customize this project,
    check out the
    vue-cli documentation.
   Installed CLI Plugins babel eslint Essential Links Core Docs Forum Community Chat Twitter News Ecosystem vue-router vuex vue-devtools vue-loader awesome-vue"
